"""เลขผลรวมดีมาก ได้แก่ 4, 5, 6, 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54  ให้คุณระดับดีมาก
                                           โอกาสประสบผลสำเร็จสูง อุปสรรคน้อย เจริญรุ่งเรือง ร่ำรวย รวดเร็ว และมีความสุขในชีวิต
เลขผลรวมดีปานกลาง ได้แก่ 8, 10, 13, 16, 18, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53  ให้คุณระดับดีปานกลาง
                                           เหนื่อย มีอุปสรรค แต่ยังมีโอกาสประสบผลสำเร็จ หากมีความพยายาม
เลขผลรวมไม่ดี ได้แก่ 3, 7, 11, 12, 17, 20, 21, 27, 29, 30, 33, 34, 37, 43, 48
                                            เหนื่อยมาก อุปสรรคมาก เจอปัญหารุมเร้า การงาน การเงิน ความรัก โอกาสเกิดอุบัติเหตุสูง """

def sum_phone(phone_number):
    total = 0
    for c in phone_number: #0123456789 loop ที่ละตัวอักษร แล้วเก็บไว้ในตัวแปร c
        total += int(c)
    return total
def interpret(number):
    meaning = ""
    if number in (4, 5, 6, 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54):
        meaning = "Very Good"
    elif number in (8, 10, 13, 16, 18, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53) :
        meaning = "Good"
    elif number in (3, 7, 11, 12, 17, 20, 21, 27, 29, 30, 33, 34, 37, 43, 48):
        meaning = "Bad"
    return meaning

# n = sum_phone("0932244819")
# print(n)
# print(interpret(n))
phone = input("enter your phine number: ") #string
print(interpret(sum_phone(phone)))